Terraform Plan for LEAP:

```
Terraform used the selected providers to generate the following execution plan. Reso  ~ update in-place

Terraform will perform the following actions:

  # google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        id                          = "projects/leap-pangeo/locations/us-central1/cl        name                        = "leap-cluster"
        # (26 unchanged attributes hidden)

      ~ monitoring_config {
            # (1 unchanged attribute hidden)

          + managed_prometheus {
              + enabled = false
            }
        }

        # (27 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

```

Terraform plan for LEAP before I added the code to ignore changes to initial_node_count:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        id                          = "projects/leap-pangeo/locations/us-central1/clusters/leap-cluster"
        name                        = "leap-cluster"
        # (26 unchanged attributes hidden)

      ~ monitoring_config {
            # (1 unchanged attribute hidden)

          + managed_prometheus {
              + enabled = false
            }
        }

        # (27 unchanged blocks hidden)
    }

  # google_container_node_pool.notebook["medium"] must be replaced
-/+ resource "google_container_node_pool" "notebook" {
      ~ id                          = "projects/leap-pangeo/locations/us-central1/clusters/leap-cluster/nodePools/nb-medium" -> (known after apply)
      ~ initial_node_count          = 10 -> 0 # forces replacement
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/leap-pangeo/zones/us-central1-c/instanceGroupManagers/gke-leap-cluster-nb-medium-b9c8ba20-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/leap-pangeo/zones/us-central1-c/instanceGroups/gke-leap-cluster-nb-medium-b9c8ba20-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "nb-medium"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 0 -> (known after apply)
      ~ node_locations              = [
          - "us-central1-c",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.24.5-gke.600" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "BALANCED" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      + network_config {
          + create_pod_range     = (known after apply)
          + enable_private_nodes = (known after apply)
          + pod_ipv4_cidr_block  = (known after apply)
          + pod_range            = (known after apply)
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
            tags              = []
            # (9 unchanged attributes hidden)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

            # (1 unchanged block hidden)
        }

      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
          ~ strategy        = "SURGE" -> (known after apply)

          + blue_green_settings {
              + node_pool_soak_duration = (known after apply)

              + standard_rollout_policy {
                  + batch_node_count    = (known after apply)
                  + batch_percentage    = (known after apply)
                  + batch_soak_duration = (known after apply)
                }
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.


```